~~This~~ is *regular* **text**.

## This is a level 2 header

In [9]:
import pandas as pd
import numpy as np

In [8]:
np.__version__

'2.2.3'

In [ ]:
my_list = [1, 2, 3]

In [ ]:
my_list[1] = 5

In [ ]:
print(my_list)

In [43]:
df_teachers1 = pd.DataFrame({'name':['Niina', 'Salla'], 'is_teaching':[True, True]})

In [44]:
df_teachers1.loc[df_teachers.name == 'Niina', 'is_teaching'] = False

In [45]:
df_teachers1

    name  is_teaching
0  Niina         True
1  Salla         True

In [46]:
df_teachers2 = pd.read_csv("teachers.csv")

In [47]:
df_teachers2[['name', 'age']]

      name  age
0  Matteus   25
1    Peter   26
2     Tony   27
3    Björn   28

In [48]:
df_teachers1

    name  is_teaching
0  Niina         True
1  Salla         True

In [74]:
new_variable = df_teachers2
new_variable

      name  is_teaching     modules  age
0  Matteus         True         5,9   25
1    Peter        False         NaN   26
2     Tony         True       4,6,8   27
3    Björn         True  1,2,3,7,10   28

In [51]:
merged_df = pd.concat([df_teachers1, df_teachers2], ignore_index=True)
merged_df

      name  is_teaching     modules   age
0    Niina         True         NaN   NaN
1    Salla         True         NaN   NaN
2  Matteus         True         5,9  25.0
3    Peter        False         NaN  26.0
4     Tony         True       4,6,8  27.0
5    Björn         True  1,2,3,7,10  28.0

In [61]:
merged_df['modules'].isna().value_counts()

modules
True     3
False    3
Name: count, dtype: int64

In [68]:
selector = merged_df.isna().any(axis='columns')

In [69]:
merged_df[selector]

    name  is_teaching modules   age
0  Niina         True     NaN   NaN
1  Salla         True     NaN   NaN
3  Peter        False     NaN  26.0